<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f0bf29d03ea8ef8cef9847397c527e0e67b7c0d1fe8856b9f05a289dd1f66435","plan_job_ref":"Job Plan Airflow DAGs #133 at https://github.com/cal-itp/data-infra/actions/runs/15716903191","plan_out_hash":"4f4a9d4ba9e6fc97d09a8699deb1c248525f9f3c596a6fef251cf4add85cfb02","plan_hash":"4a1cfb03e622b5e2b6264352537f7c62a44102213570508c7a9fa5882165c72d","plan_text_format":"diff-trunc","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 23 to add, 0 to change, 819 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/METADATA.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "LUVDVg==" -> (known after apply)
!~      detect_md5hash      = "jevwR13sditTtdlF9PgLHQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "jevwR13sditTtdlF9PgLHQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FMETADATA.yml?generation=1749686067324918&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/airtable_loader_v2/METADATA.yml"
!~      output_name         = "dags/airtable_loader_v2/METADATA.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FMETADATA.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_payment_dag.py"] will be destroyed
  # (because key ["dags/cosmos_payment_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "v0iEjA==" -> null
-       detect_md5hash      = "ouLB9SbsyCfMtXp7zMkNMw==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-dags/cosmos_payment_dag.py" -> null
-       md5hash             = "ouLB9SbsyCfMtXp7zMkNMw==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_payment_dag.py?generation=1749663110548553&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/cosmos_payment_dag.py" -> null
-       output_name         = "dags/cosmos_payment_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_payment_dag.py" -> null
-       source              = "../../../../airflow/dags/cosmos_payment_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "Wj3k0Q==" -> (known after apply)
!~      detect_md5hash      = "D00WqjAOVYTZtwgh6ae5Eg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "D00WqjAOVYTZtwgh6ae5Eg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml?generation=1749663111075098&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
!~      output_name         = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "h7XHCw==" -> (known after apply)
!~      detect_md5hash      = "nYOJGONwX2X51kpC6vr32Q==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "nYOJGONwX2X51kpC6vr32Q==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_service_alerts.yml?generation=1749663110869138&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_service_alerts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "3pBidw==" -> (known after apply)
!~      detect_md5hash      = "PMkAUgXgKXOWI9hAKwcExg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "PMkAUgXgKXOWI9hAKwcExg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_trip_updates.yml?generation=1749663110839164&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_trip_updates.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "EZifwA==" -> (known after apply)
!~      detect_md5hash      = "FQ/VHnykTRe7JRA9zoZ4vg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "FQ/VHnykTRe7JRA9zoZ4vg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_vehicle_positions.yml?generation=1749663110889017&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_vehicle_positions.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "Fx/pFw==" -> (known after apply)
!~      detect_md5hash      = "41SeveP1q/3bry+Qg88IVQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "41SeveP1q/3bry+Qg88IVQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_service_alerts.yml?generation=1749663110755965&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_service_alerts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "h/soMQ==" -> (known after apply)
!~      detect_md5hash      = "Cka3DO3IMJ0KAedBO3lvSw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Cka3DO3IMJ0KAedBO3lvSw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_trip_updates.yml?generation=1749663110840913&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_trip_updates.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "x/4ANg==" -> (known after apply)
!~      detect_md5hash      = "yLUP8g09yloVdZVzQpP9hA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "yLUP8g09yloVdZVzQpP9hA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_vehicle_positions.yml?generation=1749663110554278&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_vehicle_positions.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_open_data/publish_california_open_data.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "Wx+C0A==" -> (known after apply)
!~      detect_md5hash      = "Dmn2ccrjkUs7GTsL5zO+rw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Dmn2ccrjkUs7GTsL5zO+rw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fpublish_open_data%2Fpublish_california_open_data.yml?generation=1749663111051379&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/publish_open_data/publish_california_open_data.yml"
!~      output_name         = "dags/publish_open_data/publish_california_open_data.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fpublish_open_data%2Fpublish_california_open_data.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_mobility_database.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "H1W7NA==" -> (known after apply)
!~      detect_md5hash      = "NU/Xx+CKp2vd9Ik0GZJyQQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "NU/Xx+CKp2vd9Ik0GZJyQQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_mobility_database.yml?generation=1749663110549640&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/scrape_feed_aggregators/scrape_mobility_database.yml"
!~      output_name         = "dags/scrape_feed_aggregators/scrape_mobility_database.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_mobility_database.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_transitland.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "NfYxQA==" -> (known after apply)
!~      detect_md5hash      = "waCjURUBaVPMOeNtBfSoiA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "waCjURUBaVPMOeNtBfSoiA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_transitland.yml?generation=1749663111109188&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/scrape_feed_aggregators/scrape_transitland.yml"
!~      output_name         = "dags/scrape_feed_aggregators/scrape_transitland.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_transitland.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "EdsP8w==" -> (known after apply)
!~      detect_md5hash      = "RkFCvz17Ob0uAV3XwTuDiw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "RkFCvz17Ob0uAV3XwTuDiw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml?generation=1749663110878094&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      output_name         = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "wlePkA==" -> (known after apply)
!~      detect_md5hash      = "t+44nhARoCJF4rVEvR5jxQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "t+44nhARoCJF4rVEvR5jxQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml?generation=1749663110544982&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse/dbt_test.yml"
!~      output_name         = "dags/transform_warehouse/dbt_test.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "uMW8eg==" -> (known after apply)
!~      detect_md5hash      = "yc9BKIVWCufrnqBGHtJ+zQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "yc9BKIVWCufrnqBGHtJ+zQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml?generation=1749663111048153&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "+DVZBg==" -> (known after apply)
!~      detect_md5hash      = "uB4KDMyLm8X67b0SdoCz8Q==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "uB4KDMyLm8X67b0SdoCz8Q==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml?generation=1749663110539857&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh/dbt_test.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "qOCVbg==" -> (known after apply)
!~      detect_md5hash      = "C3LAbREGVADYwRVIU7f60A==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*****************************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "C3LAbREGVADYwRVIU7f60A==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml?generation=1749663111113305&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "u99dqA==" -> (known after apply)
!~      detect_md5hash      = "XQiR+2TSAH95+/w9FPSihg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "XQiR+2TSAH95+/w9FPSihg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml?generation=1749663110967070&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "G8NXDQ==" -> (known after apply)
!~      detect_md5hash      = "7F/5T64pEAx/osXlB9MbDA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "7F/5T64pEAx/osXlB9MbDA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml?generation=1749663110775396&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "3xUlyw==" -> (known after apply)
!~      detect_md5hash      = "zMPuOjgI6EQwPHTTIdlz9w==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "zMPuOjgI6EQwPHTTIdlz9w==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml?generation=1749663110947676&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "WAOTIw==" -> (known after apply)
!~      detect_md5hash      = "Q2KZHpa145QxEt0qrMVrvQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Q2KZHpa145QxEt0qrMVrvQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Funzip_and_validate_gtfs_schedule_hourly%2Fvalidate_gtfs_schedule.yml?generation=1749663111103271&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
!~      output_name         = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Funzip_and_validate_gtfs_schedule_hourly%2Fvalidate_gtfs_schedule.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/__init__.py"] will be destroyed
  # (because key ["plugins/hooks/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-plugins/hooks/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fhooks%2F__init__.py?generation=1749865938649593&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/hooks/__init__.py" -> null
-       output_name         = "plugins/hooks/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fhooks%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/hooks/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/airtable_hook.py"] will be destroyed
  # (because key ["plugins/hooks/airtable_hook.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "bEKaOw==" -> null
-       detect_md5hash      = "pm8nMZkNTa2Xeitm0TBOVg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-plugins/hooks/airtable_hook.py" -> null
-       md5hash             = "pm8nMZkNTa2Xeitm0TBOVg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fhooks%2Fairtable_hook.py?generation=1749865938653543&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/hooks/airtable_hook.py" -> null
-       output_name         = "plugins/hooks/airtable_hook.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fhooks%2Fairtable_hook.py" -> null
-       source              = "../../../../airflow/plugins/hooks/airtable_hook.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/__init__.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "KNXkwQ==" -> (known after apply)
!~      detect_md5hash      = "T+Hf5rudNxVmZlWvKrPiQg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*****************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "T+Hf5rudNxVmZlWvKrPiQg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2F__init__.py?generation=1749865938666984&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "plugins/operators/__init__.py"
!~      output_name         = "plugins/operators/__init__.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2F__init__.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/airtable_to_gcs.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/operators/airtable_to_gcs.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/operators/airtable_to_gcs.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/airtable_to_gcs_operator.py"] will be destroyed
  # (because key ["plugins/operators/airtable_to_gcs_operator.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "C9BvEg==" -> null
-       detect_md5hash      = "yVn4B7FIPvvxzr1d1oFNKg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-plugins/operators/airtable_to_gcs_operator.py" -> null
-       md5hash             = "yVn4B7FIPvvxzr1d1oFNKg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fairtable_to_gcs_operator.py?generation=1750182580504175&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/operators/airtable_to_gcs_operator.py" -> null
-       output_name         = "plugins/operators/airtable_to_gcs_operator.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fairtable_to_gcs_operator.py" -> null
-       source              = "../../../../airflow/plugins/operators/airtable_to_gcs_operator.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/pod_operator.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "tj5eaw==" -> (known after apply)
!~      detect_md5hash      = "OUt+5FEzBToJsY29MClGeg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "OUt+5FEzBToJsY29MClGeg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fpod_operator.py?generation=1749663110737169&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "plugins/operators/pod_operator.py"
!~      output_name         = "plugins/operators/pod_operator.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fpod_operator.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-catalog is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
-       bucket              = "calitp-staging-composer" -> null
-       content             = (sensitive value) -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "xRkbPg==" -> null
-       detect_md5hash      = "oHjxQIQxe2kBHT8cn5QQdA==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/target/catalog.json" -> null
-       md5hash             = "oHjxQIQxe2kBHT8cn5QQdA==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftarget%2Fcatalog.json?generation=1749686067714983&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/target/catalog.json" -> null
-       output_name         = "data/warehouse/target/catalog.json" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftarget%2Fcatalog.json" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["dbt_project.yml"] will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-dags is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "IkVsvQ==" -> null
-       detect_md5hash      = "3X07ZZ3feH8QU2ixlul69A==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/dbt_project.yml" -> null
-       md5hash             = "3X07ZZ3feH8QU2ixlul69A==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fdbt_project.yml?generation=1749663113227708&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/dbt_project.yml" -> null
-       output_name         = "data/warehouse/dbt_project.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fdbt_project.yml" -> null
-       source              = "../../../../warehouse/dbt_project.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/.gitkeep"] will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-dags is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/.gitkeep" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.gitkeep?generation=1749663120634221&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/macros/.gitkeep" -> null
-       output_name         = "data/warehouse/macros/.gitkeep" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.gitkeep" -> null
-       source              = "../../../../warehouse/macros/.gitkeep" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/_util_dedupe_by_freq.sql"] will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-dags is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "3rCGxw==" -> null
-       detect_md5hash      = "sIktVydtvOzgrlESxfhLQg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/_util_dedupe_by_freq.sql" -> null
-       md5hash             = "sIktVydtvOzgrlESxfhLQg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F_util_dedupe_by_freq.sql?generation=1749663117184713&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/macros/_util_dedupe_by_freq.sql" -> null
-       output_name         = "data/warehouse/macros/_util_dedupe_by_freq.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F_util_dedupe_by_freq.sql" -> null
-       source              = "../../../../warehouse/macros/_util_dedupe_by_freq.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/_util_list.sql"] will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-dags is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "DzIggw==" -> null
-       detect_md5hash      = "wEu9GM21MoHDCy0u/ftGZQ==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/_util_list.sql" -> null
-       md5hash             = "wEu9GM21MoHDCy0u/ftGZQ==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F_util_list.sql?generation=1749663118228484&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/macros/_util_list.sql" -> null
-       output_name         = "data/warehouse/macros/_util_list.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F_util_list.sql" -> null
-       source              = "../../../../warehouse/macros/_util_list.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/annotate_payments_entities.sql"] will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-dags is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "5jJSkQ==" -> null
-       detect_md5hash      = "EzCHAPKsIqnNSyeDQLR+6A==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/annotate_payments_entities.sql" -> null
-       md5hash             = "EzCHAPKsIqnNSyeDQLR+6A==" -> null
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #133](https://github.com/cal-itp/data-infra/actions/runs/15716903191)